[
  {
    "_id": 234,
    "topic": "Space",
    "userName": "SpaceX",
    "time": "2h",
    "title": "100s of SpaceX Starships land on Mars after a 6 month journey. 1000s of Martian colonists being building Mars Base 1",
    "image": "spacex.png",
    "liked": true,
    "replies": 123,
    "retuits": 432,
    "likes": 2345,
    "handle": "@spacex",
    "tuit": "You want to wake up in the morning and think the future is going to be great - and that’s what being a spacefaring civilization is all about. It’s about believing in the future and thinking that the future will be better than the past. And I can’t think of anything more exciting than going out there and being among the stars"
  },
  { "_id": 123,
    "topic": "Web Development",
    "userName": "ReactJS",
    "time": "2h",
    "title": "React.js is a component based front end library that makes it very easy to build Single Page Applications or SPAs",
    "image": "reactjs.png",
    "liked": false,
    "replies": 12,
    "retuits": 4,
    "likes": 86,
    "handle": "@reactjs",
    "tuit": "React will keep working on the client just like it does today, but this will be a new lever available to everyone to build faster apps – by reducing bytes sent and streaming data as soon as it's ready."
  },
  { "_id": 124,
    "topic": "",
    "userName": "JavaScript",
    "time": "1d",
    "title": "JavaScript is programming language that can run on browsers as well as desktops",
    "image": "js.png",
    "liked": true,
    "replies": 624,
    "retuits": 322,
    "likes": 2707,
    "handle": "@JavaScript",
    "tuit": "Just curious, are you using => functions exclusively or still sticking to traditional function syntax?"
  },
  { "_id": 125,
    "topic": "Web Development",
    "userName": "",
    "title": "jQuery",
    "time": "1w",
    "image": "jquery-blue.png",
    "liked": false,
    "replies": 1,
    "retuits": 8,
    "likes": 24,
    "handle": "@jquery",
    "tuit": "jQuery 3.6.1 has been released! This includes bug fixes, performance improvements, and lots of internal infrastructure improvements."
  },
  { "_id": 126,
    "topic": "Web Development",
    "userName": "NodeJS",
    "title": "",
    "time": "1m",
    "image": "nodejs.png",
    "liked": true,
    "replies": 11,
    "retuits": 226,
    "likes": 743,
    "handle": "@nodejs",
    "tuit": "Node.js 18 has now been promoted to LTS! With this release, many features will be available in a long-term supported release line. \n\nThank you to all of our contributors on this release"
  }
]
